Revit 2023 API
ImageType.Unload Method
 Unload the linked image.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2021
Syntax
C#
public void Unload()
Visual Basic
Public Sub Unload
Visual C++
public:
void Unload()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This ImageType is not a link. -or- The image is a PDF based image, but PDF import is not available in the installed Revit.
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document containing this ImageType is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document containing this ImageType is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document containing this ImageType has no open transaction.
See Also
ImageType Class
Autodesk.Revit.DB Namespace